Revit 2027 API
HostObjAttributes.SetCompoundStructure Method
Sets the compound structure of the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCompoundStructure(
	CompoundStructure compoundStructure
)
Public Sub SetCompoundStructure (
	compoundStructure As CompoundStructure
)
public:
void SetCompoundStructure(
	CompoundStructure^ compoundStructure
)
member SetCompoundStructure :
        compoundStructure : CompoundStructure -> unit
Parameters
compoundStructure CompoundStructure
See Also
Reference
HostObjAttributes Class
Autodesk.Revit.DB Namespace